TUT materials/T6/T6.org
#+TITLE: Tutorial #6 - Names, Bindings and Scopes
#+author: Habib Ghaffari
#+date: <2022-10-31 Mon>
# Use # for commenting your Org file
# Here I am adding the latex header
#+latex_header: \usepackage{hyperref}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{listings}
#+latex_header: \usepackage{xcolor}
#+latex_header: \usepackage{graphicx}


# Adding the color definitions
#+latex_header_extra: \definecolor{codegreen}{rgb}{0,0.6,0}
#+latex_header_extra: \definecolor{codegray}{rgb}{0.5,0.5,0.5}
#+latex_header_extra: \definecolor{codepurple}{rgb}{0.58,0,0.82}
#+latex_header_extra: \definecolor{backcolour}{rgb}{0.95,0.95,0.92}


# Adding the latex code for stylish code display
#+latex_header_extra: \lstdefinestyle{mystyle}{
#+latex_header_extra:      backgroundcolor=\color{backcolour},   
#+latex_header_extra:      commentstyle=\color{codegreen},
#+latex_header_extra:      keywordstyle=\color{magenta},
#+latex_header_extra:      numberstyle=\tiny\color{codegray},
#+latex_header_extra:      stringstyle=\color{codepurple},
#+latex_header_extra:      basicstyle=\ttfamily\footnotesize,
#+latex_header_extra:      breakatwhitespace=false,         
#+latex_header_extra:      breaklines=true,                 
#+latex_header_extra:      captionpos=b,                    
#+latex_header_extra:      keepspaces=true,                 
#+latex_header_extra:      numbers=left,                    
#+latex_header_extra:      numbersep=5pt,                  
#+latex_header_extra:      showspaces=false,                
#+latex_header_extra:      showstringspaces=false,
#+latex_header_extra:      showtabs=false,                  
#+latex_header_extra:      tabsize=2
#+latex_header_extra:  }
#+latex_header_extra:  \lstset{style=mystyle, language=Python}


* Introduction
:PROPERTIES:
:CUSTOM_ID: s1
:END:

  Today, we are going to review the topics presented in chapter 5. Then we will
  try to solve some sample examples that will help you answer some of the
  questions presented in assignment #2.

* Names
:PROPERTIES:
:CUSTOM_ID: s2
:END:

A name is a string of characters used to identify some entity in a program.
Names in most programming languages have the same form: a letter followed by a
string consisting of letters, digits, and underscore characters ~( _ )~.

Examples:

~Haskell~
#+begin_src text
  <H_ID> ::= <head> {<tail>}
  <head> ::= <upper> | <lower>
  <tail> ::= <upper> | <lower> | <special> | <digits> | '
  <lower> ::= a | b | c | d | e | f | g | h | i | j | k | l | m | n | o | p | q | r | s | t | u | v | w | x | y | z | _
  <upper> ::= A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z
  <digits> ::= 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9
#+end_src

Two main primary issues with naming are?

+ Case sensitivity
+ Special words

+ Question:
  + What is a reserved word?

+ Exercise: Look at the following names:

  1. FirstName
    
  2. First_Name
    
  3. firstname

  4. firstName

  + Which one is better in terms of Readability?

  + Which one is better in terms of Writability?

  + Which one is accepted in C programming language?

  + Which one is better in Python programming language?

  + Which one is /cammel notation/?

  + Which one is not popular anymore?


A program variable is an abstraction of a computer memory cell or collection
of cells.

Variables can be characterized as a sextuple of attributes:

+ Name

+ Address: The memory address with which it is associated

+ Value: The contents of the location with which the variable is associated

+ Type: determines the range of values of variables and the set of operations
  that are defined for values of that type; in the case of floating point, type
  also determines the precision

+ Lifetime [Discuss later]

+ Scope [Discuss later]
    
    

* Binding
:PROPERTIES:
:CUSTOM_ID: s3
:END:

A binding is an association between an entity and an attribute, such as between
a variable and its type or value, or between an operation and a symbol. Binding
time is the time at which a binding takes place.

+ A binding is static if it first occurs before run time and remains
  unchanged throughout program execution.
  + Type may be specified by explicit or implicit deceleration:

    + Question: Bring one example for each of the above decelerations:

#+begin_src c#
var sum = 0;
var total = 0.0;
var name = "Fred";
#+end_src
      
      

+ A binding is dynamic if it first occurs during execution or can change during
  execution of the program

** Storage Bindings and Lifetime



* Scope and Lifetime
:PROPERTIES:
:CUSTOM_ID: s4
:END:

The scope of a variable is the range of statements over which it is visible.

The local variables of a program unit are those that are declared in that unit.
The nonlocal variables of a program unit are those that are visible in the unit
but not declared there. Global variables are a special category of nonlocal variables

