TUT materials/T6/T6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-08 Tue 10:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial #6 - Names, Bindings and Scopes</title>
<meta name="author" content="Habib Ghaffari" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tutorial #6 - Names, Bindings and Scopes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#s1">1. Introduction</a></li>
<li><a href="#s2">2. Names</a></li>
<li><a href="#s3">3. Binding</a>
<ul>
<li><a href="#org66893ec">3.1. Storage Bindings and Lifetime</a></li>
</ul>
</li>
<li><a href="#s4">4. Scope and Lifetime</a>
<ul>
<li><a href="#org10e6283">4.1. Static Scope</a></li>
<li><a href="#org59f3ded">4.2. Blocks</a></li>
<li><a href="#org352127b">4.3. Dynamic Scope</a></li>
<li><a href="#org5830730">4.4. Referencing Enviroments</a></li>
</ul>
</li>
<li><a href="#orgd2221ab">5. Questions:</a></li>
</ul>
</div>
</div>


<div id="outline-container-s1" class="outline-2">
<h2 id="s1"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-s1">
<p>
Today, we are going to review the topics presented in chapter 5. Then we will
try to solve some sample examples that will help you answer some of the
questions presented in assignment #2.
</p>
</div>
</div>

<div id="outline-container-s2" class="outline-2">
<h2 id="s2"><span class="section-number-2">2.</span> Names</h2>
<div class="outline-text-2" id="text-s2">
<p>
A name is a string of characters used to identify some entity in a program.
Names in most programming languages have the same form: a letter followed by a
string consisting of letters, digits, and underscore characters <code>( _ )</code>.
</p>

<p>
Examples:
</p>

<p>
<code>Haskell</code>
</p>
<div class="org-src-container">
<pre class="src src-text">&lt;H_ID&gt; ::= &lt;head&gt; {&lt;tail&gt;}
&lt;head&gt; ::= &lt;upper&gt; | &lt;lower&gt;
&lt;tail&gt; ::= &lt;upper&gt; | &lt;lower&gt; | &lt;special&gt; | &lt;digits&gt; | '
&lt;lower&gt; ::= a | b | c | d | e | f | g | h | i | j | k | l | m | n | o | p | q | r | s | t | u | v | w | x | y | z | _
&lt;upper&gt; ::= A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z
&lt;digits&gt; ::= 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9
</pre>
</div>

<p>
Two main primary issues with naming are?
</p>

<ul class="org-ul">
<li>Case sensitivity</li>
<li>Special words</li>

<li>Question:
<ul class="org-ul">
<li>What is a reserved word?</li>
</ul></li>

<li>Exercise: Look at the following names:

<ol class="org-ol">
<li>FirstName</li>

<li>First<sub>Name</sub></li>

<li>firstname</li>

<li>firstName</li>

<li>Which one is better in terms of Readability?</li>

<li>Which one is better in terms of Writability?</li>

<li>Which one is accepted in C programming language?</li>

<li>Which one is better in Python programming language?</li>

<li>Which one is <i>cammel notation</i>?</li>

<li>Which one is not popular anymore?</li>
</ol></li>
</ul>


<p>
A program variable is an abstraction of a computer memory cell or collection
of cells.
</p>

<p>
Variables can be characterized as a sextuple of attributes:
</p>

<ul class="org-ul">
<li>Name</li>

<li>Address: The memory address with which it is associated</li>

<li>Value: The contents of the location with which the variable is associated</li>

<li>Type: determines the range of values of variables and the set of operations
that are defined for values of that type; in the case of floating point, type
also determines the precision</li>

<li>Lifetime [Discuss later]</li>

<li>Scope [Discuss later]</li>
</ul>
</div>
</div>



<div id="outline-container-s3" class="outline-2">
<h2 id="s3"><span class="section-number-2">3.</span> Binding</h2>
<div class="outline-text-2" id="text-s3">
<p>
A binding is an association between an entity and an attribute, such as between
a variable and its type or value, or between an operation and a symbol. Binding
time is the time at which a binding takes place.
</p>

<ul class="org-ul">
<li>A binding is static if it first occurs before run time and remains
unchanged throughout program execution.
<ul class="org-ul">
<li>Type may be specified by explicit or implicit deceleration:

<ul class="org-ul">
<li>Question: Bring one example for each of the above decelerations:</li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-c#">var sum = 0;
var total = 0.0;
var name = "Fred";
</pre>
</div>



<ul class="org-ul">
<li>A binding is dynamic if it first occurs during execution or can change during
execution of the program</li>
</ul>
</div>

<div id="outline-container-org66893ec" class="outline-3">
<h3 id="org66893ec"><span class="section-number-3">3.1.</span> Storage Bindings and Lifetime</h3>
</div>
</div>



<div id="outline-container-s4" class="outline-2">
<h2 id="s4"><span class="section-number-2">4.</span> Scope and Lifetime</h2>
<div class="outline-text-2" id="text-s4">
<p>
The scope of a variable is the range of statements over which it is visible.
</p>

<p>
The local variables of a program unit are those that are declared in that unit.
The nonlocal variables of a program unit are those that are visible in the unit
but not declared there. Global variables are a special category of nonlocal variables
</p>
</div>
