TUT materials/T6/T6.tex
% Created 2022-11-08 Tue 10:27
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{hyperref}
\usepackage{amsmath}
\usepackage{listings}
\usepackage{xcolor}
\usepackage{graphicx}
\definecolor{codegreen}{rgb}{0,0.6,0}
\definecolor{codegray}{rgb}{0.5,0.5,0.5}
\definecolor{codepurple}{rgb}{0.58,0,0.82}
\definecolor{backcolour}{rgb}{0.95,0.95,0.92}
\lstdefinestyle{mystyle}{
backgroundcolor=\color{backcolour},
commentstyle=\color{codegreen},
keywordstyle=\color{magenta},
numberstyle=\tiny\color{codegray},
stringstyle=\color{codepurple},
basicstyle=\ttfamily\footnotesize,
breakatwhitespace=false,
breaklines=true,
captionpos=b,
keepspaces=true,
numbers=left,
numbersep=5pt,
showspaces=false,
showstringspaces=false,
showtabs=false,
tabsize=2
}
\lstset{style=mystyle, language=Python}
\author{Habib Ghaffari}
\date{\textit{<2022-10-31 Mon>}}
\title{Tutorial \#6 - Names, Bindings and Scopes}
\hypersetup{
 pdfauthor={Habib Ghaffari},
 pdftitle={Tutorial \#6 - Names, Bindings and Scopes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Introduction}
\label{s1}
Today, we are going to review the topics presented in chapter 5. Then we will
try to solve some sample examples that will help you answer some of the
questions presented in assignment \#2.

\section{Names}
\label{s2}
A name is a string of characters used to identify some entity in a program.
Names in most programming languages have the same form: a letter followed by a
string consisting of letters, digits, and underscore characters \texttt{( \_ )}.

Examples:

\texttt{Haskell}
\begin{verbatim}
<H_ID> ::= <head> {<tail>}
<head> ::= <upper> | <lower>
<tail> ::= <upper> | <lower> | <special> | <digits> | '
<lower> ::= a | b | c | d | e | f | g | h | i | j | k | l | m | n | o | p | q | r | s | t | u | v | w | x | y | z | _
<upper> ::= A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z
<digits> ::= 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9
\end{verbatim}

Two main primary issues with naming are?

\begin{itemize}
\item Case sensitivity
\item Special words

\item Question:
\begin{itemize}
\item What is a reserved word?
\end{itemize}

\item Exercise: Look at the following names:

\begin{enumerate}
\item FirstName

\item First\textsubscript{Name}

\item firstname

\item firstName

\item Which one is better in terms of Readability?

\item Which one is better in terms of Writability?

\item Which one is accepted in C programming language?

\item Which one is better in Python programming language?

\item Which one is \emph{cammel notation}?

\item Which one is not popular anymore?
\end{enumerate}
\end{itemize}


A program variable is an abstraction of a computer memory cell or collection
of cells.

Variables can be characterized as a sextuple of attributes:

\begin{itemize}
\item Name

\item Address: The memory address with which it is associated

\item Value: The contents of the location with which the variable is associated

\item Type: determines the range of values of variables and the set of operations
that are defined for values of that type; in the case of floating point, type
also determines the precision

\item Lifetime [Discuss later]

\item Scope [Discuss later]
\end{itemize}



\section{Binding}
\label{s3}
A binding is an association between an entity and an attribute, such as between
a variable and its type or value, or between an operation and a symbol. Binding
time is the time at which a binding takes place.

\begin{itemize}
\item A binding is static if it first occurs before run time and remains
unchanged throughout program execution.
\begin{itemize}
\item Type may be specified by explicit or implicit deceleration:

\begin{itemize}
\item Question: Bring one example for each of the above decelerations:
\end{itemize}
\end{itemize}
\end{itemize}

\begin{verbatim}
var sum = 0;
var total = 0.0;
var name = "Fred";
\end{verbatim}



\begin{itemize}
\item A binding is dynamic if it first occurs during execution or can change during
execution of the program
\end{itemize}

\subsection{Storage Bindings and Lifetime}
\label{sec:orge5f5087}



\section{Scope and Lifetime}
\label{s4}
The scope of a variable is the range of statements over which it is visible.

The local variables of a program unit are those that are declared in that unit.
The nonlocal variables of a program unit are those that are visible in the unit
but not declared there. Global variables are a special category of nonlocal variables
