TUT materials/T6/T6.org
** Static Scope

The general rule for tracing visibility of a variable:

+ Search declarations, first locally, then in increasingly larger enclosing
  scopes, until one is found for the given name
  
+ Enclosing static scopes (to a specific scope) are called its static ancestors;
  the nearest static ancestor is called a static parent

+ Some languages allow nested subprogram definitions, which create nested static
  scopes

+  Variables can be hidden from a unit by having a "closer" variable with the
  same name


#+begin_src javascript

function big() { function sub1() {
var x = 7;
sub2(); }
function sub2() { var y = x;
}
var x = 3; sub1();
}
#+end_src

What if we consider the static scope rules to trace the visibility of ~x~:

** Blocks

+ The scopes created by blocks, which could be nested in larger blocks, are
  treated exactly like those created by subprograms.

#+begin_src c
  void sub() {
     int count=1;
      while (count <=100) {
        int count=2;
        count++;
        ...
     }
     printf(count);
     ...
  }
#+end_src



+ In ~Let~ Scheme:

#+begin_src tex
In Scheme:
(LET (
   (name1 expression1) ...
   (namen expressionn)
)
#+end_src

** Dynamic Scope

General rule for tracing visibility in dynamic scope:

+ Based on calling sequences of program units, not their textual layout

+ References to variables are connected to declarations by searching back
  through the chain of subprogram calls that forced execution to this point
  
#+begin_src javascript
      function big() {
          function sub1() {
            var x = 7;
            sub2();
          }
          function sub2() { var y = x;
          }
          var x = 3;
          sub1();
      }
#+end_src

Consider tracing this code based on dynamic scope rules. What would be the
reference point for ~x~?

When it comes to lifetime, it becomes a bit confusing. Even though it seems that
these two are related to each other but they are totally different concepts.


