TUT materials/T6/T6.html

<div id="outline-container-org10e6283" class="outline-3">
<h3 id="org10e6283"><span class="section-number-3">4.1.</span> Static Scope</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The general rule for tracing visibility of a variable:
</p>

<ul class="org-ul">
<li>Search declarations, first locally, then in increasingly larger enclosing
scopes, until one is found for the given name</li>

<li>Enclosing static scopes (to a specific scope) are called its static ancestors;
the nearest static ancestor is called a static parent</li>

<li>Some languages allow nested subprogram definitions, which create nested static
scopes</li>

<li>Variables can be hidden from a unit by having a "closer" variable with the
same name</li>
</ul>


<div class="org-src-container">
<pre class="src src-javascript">
<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">big</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> <span style="color: #4f97d7; font-weight: bold;">function</span> sub1<span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span> = <span style="color: #a45bad;">7</span>;
sub2<span style="color: #2d9574;">()</span>; <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub2</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span> <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">y</span> = x;
<span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span> = <span style="color: #a45bad;">3</span>; sub1<span style="color: #bc6ec5;">()</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
What if we consider the static scope rules to trace the visibility of <code>x</code>:
</p>
</div>
</div>

<div id="outline-container-org59f3ded" class="outline-3">
<h3 id="org59f3ded"><span class="section-number-3">4.2.</span> Blocks</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>The scopes created by blocks, which could be nested in larger blocks, are
treated exactly like those created by subprograms.</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">sub</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
   <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">count</span>=<span style="color: #a45bad;">1</span>;
    <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #bc6ec5;">(</span>count &lt;=<span style="color: #a45bad;">100</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
      <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">count</span>=<span style="color: #a45bad;">2</span>;
      count++;
      ...
   <span style="color: #bc6ec5;">}</span>
   printf<span style="color: #bc6ec5;">(</span>count<span style="color: #bc6ec5;">)</span>;
   ...
<span style="color: #4f97d7;">}</span>
</pre>
</div>



<ul class="org-ul">
<li>In <code>Let</code> Scheme:</li>
</ul>

<div class="org-src-container">
<pre class="src src-tex">In Scheme:
(LET (
   (name1 expression1) ...
   (namen expressionn)
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org352127b" class="outline-3">
<h3 id="org352127b"><span class="section-number-3">4.3.</span> Dynamic Scope</h3>
<div class="outline-text-3" id="text-4-3">
<p>
General rule for tracing visibility in dynamic scope:
</p>

<ul class="org-ul">
<li>Based on calling sequences of program units, not their textual layout</li>

<li>References to variables are connected to declarations by searching back
through the chain of subprogram calls that forced execution to this point</li>
</ul>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">big</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub1</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
      <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span> = <span style="color: #a45bad;">7</span>;
      sub2<span style="color: #2d9574;">()</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub2</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span> <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">y</span> = x;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span> = <span style="color: #a45bad;">3</span>;
    sub1<span style="color: #bc6ec5;">()</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Consider tracing this code based on dynamic scope rules. What would be the
reference point for <code>x</code>?
</p>

<p>
When it comes to lifetime, it becomes a bit confusing. Even though it seems that
these two are related to each other but they are totally different concepts.
</p>
</div>
</div>
