TUT materials/T6/T6.tex

\subsection{Static Scope}
\label{sec:org272fbdd}

The general rule for tracing visibility of a variable:

\begin{itemize}
\item Search declarations, first locally, then in increasingly larger enclosing
scopes, until one is found for the given name

\item Enclosing static scopes (to a specific scope) are called its static ancestors;
the nearest static ancestor is called a static parent

\item Some languages allow nested subprogram definitions, which create nested static
scopes

\item Variables can be hidden from a unit by having a "closer" variable with the
same name
\end{itemize}


\begin{verbatim}

function big() { function sub1() {
var x = 7;
sub2(); }
function sub2() { var y = x;
}
var x = 3; sub1();
}
\end{verbatim}

What if we consider the static scope rules to trace the visibility of \texttt{x}:

\subsection{Blocks}
\label{sec:org2f98579}

\begin{itemize}
\item The scopes created by blocks, which could be nested in larger blocks, are
treated exactly like those created by subprograms.
\end{itemize}

\begin{verbatim}
void sub() {
   int count=1;
    while (count <=100) {
      int count=2;
      count++;
      ...
   }
   printf(count);
   ...
}
\end{verbatim}



\begin{itemize}
\item In \texttt{Let} Scheme:
\end{itemize}

\begin{verbatim}
In Scheme:
(LET (
   (name1 expression1) ...
   (namen expressionn)
)
\end{verbatim}

\subsection{Dynamic Scope}
\label{sec:orgab133dc}

General rule for tracing visibility in dynamic scope:

\begin{itemize}
\item Based on calling sequences of program units, not their textual layout

\item References to variables are connected to declarations by searching back
through the chain of subprogram calls that forced execution to this point
\end{itemize}

\begin{verbatim}
function big() {
    function sub1() {
      var x = 7;
      sub2();
    }
    function sub2() { var y = x;
    }
    var x = 3;
    sub1();
}
\end{verbatim}

Consider tracing this code based on dynamic scope rules. What would be the
reference point for \texttt{x}?

When it comes to lifetime, it becomes a bit confusing. Even though it seems that
these two are related to each other but they are totally different concepts.
