TUT materials/T6/T6.html


<div id="outline-container-org5830730" class="outline-3">
<h3 id="org5830730"><span class="section-number-3">4.4.</span> Referencing Enviroments</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The referencing environment of a statement is the collection of all variables
that are visible in the statement. The referencing environment of a statement in
a static- scoped language is the variables declared in its local scope plus the
collection of all variables of its ancestor scopes that are visible.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">g</span> = <span style="color: #a45bad;">3</span>; <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">A global</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">sub1</span><span style="color: #4f97d7;">()</span>:
<span style="color: #7590db;">a</span> = <span style="color: #a45bad;">5</span>; <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Creates a local</span>
<span style="color: #7590db;">b</span> = <span style="color: #a45bad;">7</span>; <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Creates another local</span>
. . . &lt;------------------------------ <span style="color: #a45bad;">1</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">sub2</span><span style="color: #4f97d7;">()</span>:
<span style="color: #4f97d7; font-weight: bold;">global</span> g; <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Global g is now assignable here</span>
<span style="color: #7590db;">c</span> = <span style="color: #a45bad;">9</span>; <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Creates a new local</span>
. . . &lt;------------------------------ <span style="color: #a45bad;">2</span> <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">sub3</span><span style="color: #4f97d7;">()</span>:
<span style="color: #4f97d7; font-weight: bold;">nonlocal</span> <span style="color: #7590db;">c</span>: <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Makes nonlocal c visible here g = 11; # Creates a new local</span>
. . . &lt;------------------------------ <span style="color: #a45bad;">3</span>
</pre>
</div>


<p>
The referencing environments of the indicated program points are as follows:
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">pints</th>
<th scope="col" class="org-left">Variables</th>
<th scope="col" class="org-left">Where Declared</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1)</td>
<td class="org-left">a b</td>
<td class="org-left">sub 1</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">g</td>
<td class="org-left">g for referencing</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2)</td>
<td class="org-left">c</td>
<td class="org-left">sub2</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">g</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">3)</td>
<td class="org-left">c</td>
<td class="org-left">nonlocal sub2</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">g</td>
<td class="org-left">sub 3 (local)</td>
</tr>
</tbody>
</table>

<p>
Let's have a look at another example:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">void</span> <span style="color: #7590db;">sub1</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>;
  . . . &lt;------------ <span style="color: #a45bad;">1</span>
 <span style="color: #4f97d7;">}</span> <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">end of sub1</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #4f97d7; font-weight: bold;">void</span> <span style="color: #7590db;">sub2</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span>, <span style="color: #7590db;">c</span>;
 . . . . &lt;------------ <span style="color: #a45bad;">2</span> sub1<span style="color: #bc6ec5;">()</span>;
 <span style="color: #4f97d7;">}</span> <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">end of sub2</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #4f97d7; font-weight: bold;">void</span> <span style="color: #7590db;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
 <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">c</span>, <span style="color: #7590db;">d</span>;
 . . . &lt;------------ <span style="color: #a45bad;">3</span>
 sub2<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7;">}</span>  <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">end of main</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
</pre>
</div>

<p>
Consider the following example program. Assume that the only function calls are
the following: <code>main</code> calls <code>sub2</code>, which calls <code>sub1</code>.
</p>

<p>
The referencing environments of the indicated program points are as follows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">pints</th>
<th scope="col" class="org-left">Variables</th>
<th scope="col" class="org-left">Where Declared</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1)</td>
<td class="org-left">a b</td>
<td class="org-left">sub1</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">c</td>
<td class="org-left">sub2</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">d</td>
<td class="org-left">main</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">b c of sub2</td>
<td class="org-left">hidden</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">b of main</td>
<td class="org-left">hidden</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2)</td>
<td class="org-left">b c</td>
<td class="org-left">sub2</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">d</td>
<td class="org-left">main</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">c of main</td>
<td class="org-left">hidden</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">3)</td>
<td class="org-left">c d</td>
<td class="org-left">main</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
