TUT materials/T6/T6.tex


\subsection{Referencing Enviroments}
\label{sec:org230ce70}

The referencing environment of a statement is the collection of all variables
that are visible in the statement. The referencing environment of a statement in
a static- scoped language is the variables declared in its local scope plus the
collection of all variables of its ancestor scopes that are visible.

\begin{verbatim}
g = 3; # A global
def sub1():
a = 5; # Creates a local
b = 7; # Creates another local
. . . <------------------------------ 1
def sub2():
global g; # Global g is now assignable here
c = 9; # Creates a new local
. . . <------------------------------ 2 def sub3():
nonlocal c: # Makes nonlocal c visible here g = 11; # Creates a new local
. . . <------------------------------ 3
\end{verbatim}


The referencing environments of the indicated program points are as follows:


\begin{center}
\begin{tabular}{rll}
\hline
pints & Variables & Where Declared\\
\hline
1) & a b & sub 1\\
 & g & g for referencing\\
\hline
2) & c & sub2\\
 & g & \\
\hline
3) & c & nonlocal sub2\\
 & g & sub 3 (local)\\
\hline
\end{tabular}
\end{center}

Let's have a look at another example:

\begin{verbatim}
void sub1() {
  int a, b;
  . . . <------------ 1
 } /* end of sub1 */
void sub2() {
  int b, c;
 . . . . <------------ 2 sub1();
 } /* end of sub2 */
void main() {
 int c, d;
 . . . <------------ 3
 sub2();
  }  /* end of main */
\end{verbatim}

Consider the following example program. Assume that the only function calls are
the following: \texttt{main} calls \texttt{sub2}, which calls \texttt{sub1}.

The referencing environments of the indicated program points are as follows:

\begin{center}
\begin{tabular}{rll}
\hline
pints & Variables & Where Declared\\
\hline
1) & a b & sub1\\
 & c & sub2\\
 & d & main\\
 & b c of sub2 & hidden\\
 & b of main & hidden\\
\hline
2) & b c & sub2\\
 & d & main\\
 & c of main & hidden\\
\hline
3) & c d & main\\
 &  & \\
\hline
\end{tabular}
\end{center}
