TUT materials/T6/T6.org
* Questions:

1.  Consider the following JavaScript skeletal program:

#+begin_src javascript
  // The main program
  var x;
  function sub1(){
      var x:
      function sub2(){
          . . .
      }
  } 
  function sub3(){
  . . .
 }
#+end_src

Assume that the execution of this program is in the following unit order:

+ ~main~ calls ~sub1~
+ ~sub1~ calls ~sub2~
+ ~sub2~ calls ~sub3~

Assuming static scoping, in the following, which declaration of ~x~ is the
correct one for a reference to ~x~?

 i. ~sub1~, Why? (sub1)
 ii. ~sub2~, Why? (sub1)
 iii. ~sub3~, Why? (main)

Repeat part a, but assume dynamic scoping:


 i. ~sub1~, Why? (sub1)
 ii. ~sub2~, Why? (sub1) 
 iii. ~sub3~, Why? (sub1)

2. Let's write a peace of code in ~JavaScript~:

#+begin_src javascript
var x;
function sub1() {
 document.write("x = " + x + "");
}
function sub2() {
 var x;

 x = 10;
 sub1();
}
x = 5;
sub2();
#+end_src

+ What value of ~x~ is displayed if we use static-scope rules? Why?

  x = 5

+ What if we use dynamic-scope rules? Why?

  x = 10

3. Let's write another piece of code in ~JavaScript~:

#+begin_src javascript
var x, y, z;
function sub1() {
var a, y, z;
  function sub2() {
   var a, b, z;
   . . .
  }
  . . .
}
function sub3() {
  var a, x, w;
  . . .
}
#+end_src
  
List all the variables, along with the program units where they are declared,
that are visible in the bodies of ~sub1~, ~sub2~, and ~sub3~, assuming
static scoping is used. Justify your answer:

+ In sub1:
  a     sub1
  y     sub1
  z     sub1
  x     main
+ In sub2:
  a sub2
  b     sub2
  z     sub2
  y     sub1
  x     main
+ In sub3:
  a sub3
  x sub3
  w sub3
  y main
  z main

4. Consider the following ~C~ program:

#+begin_src c
void fun(void) {
int a, b, c; /* definition 1 */
. . .
while (. . .) {
int b, c, d; /*definition 2 */
. . . <------------- 1
while (. . .) {
int c, d, e; /* definition 3 */
. . . <------------- 2
}
. . . <-------------- 3
}
. . . <---------------- 4
}
#+end_src

For each of the four marked points in this function, list each visible variable,
along with the number of the definition statement that defines it. Justify your
answer?


+ Point 1:
  a 1
  b 2
  c 2
  d 2
+ Point 2:
  a 1
  b 2
  c 3
  d 3
  e 3
+ Point 3:
  a 1
  b 2
  c 2
  d 2
Point 4:
  a 1
  b 1
  c 1


5. Consider the following skeletal ~C~ program:

#+begin_src c
void fun1(void); /* prototype */
void fun2(void); /* prototype */
void fun3(void); /* prototype */
void main() {
int a, b, c;
. . .
}
void fun1(void) {
int b, c, d;
. . .
}
void fun2(void) {
int c, d, e;
. . .
}
void fun3(void) {
int d, e, f;
. . .
}
#+end_src

Given the following calling sequences and assuming that dynamic scoping is used,
what variables are visible during execution of the last function called? Include
with each visible variable the name of the function in which it was defined.
Justify your answer?

a. ~main~ calls ~fun1~; ~fun1~ calls ~fun2~; ~fun2~ calls ~fun3~.
b. ~main~ calls ~fun1~; ~fun1~ calls ~fun3~.
c. ~main~ calls ~fun2~; ~fun2~ calls ~fun3~; ~fun3~ calls ~fun1~.
d. ~main~ calls ~fun3~; ~fun3~ calls ~fun1~.
e. ~main~ calls ~fun1~; ~fun1~ calls ~fun3~; ~fun3~ calls ~fun2~.
f. ~main~ calls ~fun3~; ~fun3~ calls ~fun2~; ~fun2~ calls ~fun1~.

|----------+-----------+----------------|
| Question | Variables | Where Declared |
|----------+-----------+----------------|
| a)       | d e f     | fun3           |
|          | c         | fun2           |
|          | b         | fun1           |
|          | a         | main           |
|----------+-----------+----------------|
| b)       | d e f     | fun3           |
|          | b c       | fun1           |
|          | a         | main           |
|----------+-----------+----------------|
| c)       | b c d     | fun1           |
|          | e f       | fun3           |
|          | a         | main           |
|----------+-----------+----------------|
| d)       | b c d     | fun1           |
|          | e f       | fun3           |
|          | a         | main           |
|----------+-----------+----------------|
| e)       | c d e     | fun2           |
|          | f         | fun3           |
|          | b         | fun1           |
|          | a         | main           |
|----------+-----------+----------------|
| f)       | b c d     | fun1           |
|          | e         | fun2           |
|          | f         | fun3           |
|          | a         | main           |
|----------+-----------+----------------|

6. Consider the following program, written in ~JavaScript~-like
syntax:

#+begin_src javascript
// main program
var x, y, z;
function sub1() {
var a, y, z;
. . .
}
function sub2() {
var a, b, z;
. . .
}
function sub3() {
var a, x, w;
. . .
}  
#+end_src


Given the following calling sequences and assuming that dynamic scoping
is used, what variables are visible during execution of the last subprogram
activated? Include with each visible variable the name of the unit
where it is declared.


a. ~main~ calls ~sub1~; ~sub1~ calls ~sub2~; ~sub2~ calls ~sub3~.
b. ~main~ calls ~sub1~; ~sub1~ calls ~sub3~.
c. ~main~ calls ~sub2~; ~sub2~ calls ~sub3~; ~sub3~ calls ~sub1~.
d. ~main~ calls ~sub3~; ~sub3~ calls ~sub1~.
e. ~main~ calls ~sub1~; ~sub1~ calls ~sub3~; ~sub3~ calls ~sub2~.
f. ~main~ calls ~sub3~; ~sub3~ calls ~sub2~; ~sub2~ calls ~sub1~.

|----------+-----------+----------------|
| Question | Variables | Where Declared |
|----------+-----------+----------------|
| a)       | a x w     | sub3           |
|          | b z       | sub2           |
|          | y         | sub1           |
|----------+-----------+----------------|
| b)       | a x w     | sub3           |
|          | y z       | sub1           |
|----------+-----------+----------------|
| c)       | a y z     | sub1           |
|          | x w       | sub3           |
|          | b         | sub2           |
|----------+-----------+----------------|
| d)       | a y z     | sub1           |
|          | x w       | sub3           |
|----------+-----------+----------------|
| e)       | a b z     | sub2           |
|          | x w       | sub3           |
|          | y         | sub1           |
|----------+-----------+----------------|
| f)       | a y z     | sub1           |
|          | b         | sub2           |
|          | x w       | sub3           |
|----------+-----------+----------------|
