TUT materials/T6/T6.html

<div id="outline-container-orgd2221ab" class="outline-2">
<h2 id="orgd2221ab"><span class="section-number-2">5.</span> Questions:</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Consider the following JavaScript skeletal program:</li>
</ol>

<div class="org-src-container">
<pre class="src src-javascript"> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">The main program</span>
 <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span>;
 <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub1</span><span style="color: #4f97d7;">(){</span>
     <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span>:
     <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub2</span><span style="color: #bc6ec5;">(){</span>
         . . .
     <span style="color: #bc6ec5;">}</span>
 <span style="color: #4f97d7;">}</span> 
 <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub3</span><span style="color: #4f97d7;">(){</span>
 . . .
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Assume that the execution of this program is in the following unit order:
</p>

<ul class="org-ul">
<li><code>main</code> calls <code>sub1</code></li>
<li><code>sub1</code> calls <code>sub2</code></li>
<li><code>sub2</code> calls <code>sub3</code></li>
</ul>

<p>
Assuming static scoping, in the following, which declaration of <code>x</code> is the
correct one for a reference to <code>x</code>?
</p>

<p>
i. <code>sub1</code>, Why? (sub1)
ii. <code>sub2</code>, Why? (sub1)
iii. <code>sub3</code>, Why? (main)
</p>

<p>
Repeat part a, but assume dynamic scoping:
</p>


<p>
i. <code>sub1</code>, Why? (sub1)
ii. <code>sub2</code>, Why? (sub1) 
iii. <code>sub3</code>, Why? (sub1)
</p>

<ol class="org-ol">
<li>Let's write a peace of code in <code>JavaScript</code>:</li>
</ol>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span>;
<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub1</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
 document.write<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"x = "</span> + x + <span style="color: #2d9574;">""</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub2</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
 <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span>;

 x = <span style="color: #a45bad;">10</span>;
 sub1<span style="color: #bc6ec5;">()</span>;
<span style="color: #4f97d7;">}</span>
x = <span style="color: #a45bad;">5</span>;
sub2<span style="color: #4f97d7;">()</span>;
</pre>
</div>

<ul class="org-ul">
<li><p>
What value of <code>x</code> is displayed if we use static-scope rules? Why?
</p>

<p>
x = 5
</p></li>

<li><p>
What if we use dynamic-scope rules? Why?
</p>

<p>
x = 10
</p></li>

<li>Let's write another piece of code in <code>JavaScript</code>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span>, <span style="color: #7590db;">y</span>, <span style="color: #7590db;">z</span>;
<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub1</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">a</span>, <span style="color: #7590db;">y</span>, <span style="color: #7590db;">z</span>;
  <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub2</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
   <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>, <span style="color: #7590db;">z</span>;
   . . .
  <span style="color: #bc6ec5;">}</span>
  . . .
<span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub3</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">a</span>, <span style="color: #7590db;">x</span>, <span style="color: #7590db;">w</span>;
  . . .
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
List all the variables, along with the program units where they are declared,
that are visible in the bodies of <code>sub1</code>, <code>sub2</code>, and <code>sub3</code>, assuming
static scoping is used. Justify your answer:
</p>

<ul class="org-ul">
<li>In sub1:
a     sub1
y     sub1
z     sub1
x     main</li>
<li>In sub2:
a sub2
b     sub2
z     sub2
y     sub1
x     main</li>
<li>In sub3:
a sub3
x sub3
w sub3
y main
z main</li>

<li>Consider the following <code>C</code> program:</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">fun</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>, <span style="color: #7590db;">c</span>; <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">definition 1</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
. . .
<span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #bc6ec5;">(</span>. . .<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span>, <span style="color: #7590db;">c</span>, <span style="color: #7590db;">d</span>; <span style="color: #2aa1ae; background-color: #292e34;">/*</span><span style="color: #2aa1ae; background-color: #292e34;">definition 2</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
. . . &lt;------------- <span style="color: #a45bad;">1</span>
<span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #2d9574;">(</span>. . .<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">c</span>, <span style="color: #7590db;">d</span>, <span style="color: #7590db;">e</span>; <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">definition 3</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
. . . &lt;------------- <span style="color: #a45bad;">2</span>
<span style="color: #2d9574;">}</span>
. . . &lt;-------------- <span style="color: #a45bad;">3</span>
<span style="color: #bc6ec5;">}</span>
. . . &lt;---------------- <span style="color: #a45bad;">4</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
For each of the four marked points in this function, list each visible variable,
along with the number of the definition statement that defines it. Justify your
answer?
</p>


<ul class="org-ul">
<li>Point 1:
a 1
b 2
c 2
d 2</li>
<li>Point 2:
a 1
b 2
c 3
d 3
e 3</li>
<li>Point 3:
a 1
b 2
c 2
d 2</li>
</ul>
<p>
Point 4:
  a 1
  b 1
  c 1
</p>


<ol class="org-ol">
<li>Consider the following skeletal <code>C</code> program:</li>
</ol>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">fun1</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span>; <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">prototype</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">fun2</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span>; <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">prototype</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">fun3</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span>; <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">prototype</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>, <span style="color: #7590db;">c</span>;
. . .
<span style="color: #4f97d7;">}</span>
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">fun1</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span>, <span style="color: #7590db;">c</span>, <span style="color: #7590db;">d</span>;
. . .
<span style="color: #4f97d7;">}</span>
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">fun2</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">c</span>, <span style="color: #7590db;">d</span>, <span style="color: #7590db;">e</span>;
. . .
<span style="color: #4f97d7;">}</span>
<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">fun3</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">d</span>, <span style="color: #7590db;">e</span>, <span style="color: #7590db;">f</span>;
. . .
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Given the following calling sequences and assuming that dynamic scoping is used,
what variables are visible during execution of the last function called? Include
with each visible variable the name of the function in which it was defined.
Justify your answer?
</p>

<p>
a. <code>main</code> calls <code>fun1</code>; <code>fun1</code> calls <code>fun2</code>; <code>fun2</code> calls <code>fun3</code>.
b. <code>main</code> calls <code>fun1</code>; <code>fun1</code> calls <code>fun3</code>.
c. <code>main</code> calls <code>fun2</code>; <code>fun2</code> calls <code>fun3</code>; <code>fun3</code> calls <code>fun1</code>.
d. <code>main</code> calls <code>fun3</code>; <code>fun3</code> calls <code>fun1</code>.
e. <code>main</code> calls <code>fun1</code>; <code>fun1</code> calls <code>fun3</code>; <code>fun3</code> calls <code>fun2</code>.
f. <code>main</code> calls <code>fun3</code>; <code>fun3</code> calls <code>fun2</code>; <code>fun2</code> calls <code>fun1</code>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Variables</th>
<th scope="col" class="org-left">Where Declared</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a)</td>
<td class="org-left">d e f</td>
<td class="org-left">fun3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">c</td>
<td class="org-left">fun2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">b</td>
<td class="org-left">fun1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
<td class="org-left">main</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">b)</td>
<td class="org-left">d e f</td>
<td class="org-left">fun3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">b c</td>
<td class="org-left">fun1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
<td class="org-left">main</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">c)</td>
<td class="org-left">b c d</td>
<td class="org-left">fun1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e f</td>
<td class="org-left">fun3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
<td class="org-left">main</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">d)</td>
<td class="org-left">b c d</td>
<td class="org-left">fun1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e f</td>
<td class="org-left">fun3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
<td class="org-left">main</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">e)</td>
<td class="org-left">c d e</td>
<td class="org-left">fun2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f</td>
<td class="org-left">fun3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">b</td>
<td class="org-left">fun1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
<td class="org-left">main</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">f)</td>
<td class="org-left">b c d</td>
<td class="org-left">fun1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e</td>
<td class="org-left">fun2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f</td>
<td class="org-left">fun3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
<td class="org-left">main</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>Consider the following program, written in <code>JavaScript</code>-like</li>
</ol>
<p>
syntax:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">main program</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span>, <span style="color: #7590db;">y</span>, <span style="color: #7590db;">z</span>;
<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub1</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">a</span>, <span style="color: #7590db;">y</span>, <span style="color: #7590db;">z</span>;
. . .
<span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub2</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>, <span style="color: #7590db;">z</span>;
. . .
<span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">sub3</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">a</span>, <span style="color: #7590db;">x</span>, <span style="color: #7590db;">w</span>;
. . .
<span style="color: #4f97d7;">}</span>  
</pre>
</div>


<p>
Given the following calling sequences and assuming that dynamic scoping
is used, what variables are visible during execution of the last subprogram
activated? Include with each visible variable the name of the unit
where it is declared.
</p>


<p>
a. <code>main</code> calls <code>sub1</code>; <code>sub1</code> calls <code>sub2</code>; <code>sub2</code> calls <code>sub3</code>.
b. <code>main</code> calls <code>sub1</code>; <code>sub1</code> calls <code>sub3</code>.
c. <code>main</code> calls <code>sub2</code>; <code>sub2</code> calls <code>sub3</code>; <code>sub3</code> calls <code>sub1</code>.
d. <code>main</code> calls <code>sub3</code>; <code>sub3</code> calls <code>sub1</code>.
e. <code>main</code> calls <code>sub1</code>; <code>sub1</code> calls <code>sub3</code>; <code>sub3</code> calls <code>sub2</code>.
f. <code>main</code> calls <code>sub3</code>; <code>sub3</code> calls <code>sub2</code>; <code>sub2</code> calls <code>sub1</code>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Variables</th>
<th scope="col" class="org-left">Where Declared</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a)</td>
<td class="org-left">a x w</td>
<td class="org-left">sub3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">b z</td>
<td class="org-left">sub2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">y</td>
<td class="org-left">sub1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">b)</td>
<td class="org-left">a x w</td>
<td class="org-left">sub3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">y z</td>
<td class="org-left">sub1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">c)</td>
<td class="org-left">a y z</td>
<td class="org-left">sub1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">x w</td>
<td class="org-left">sub3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">b</td>
<td class="org-left">sub2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">d)</td>
<td class="org-left">a y z</td>
<td class="org-left">sub1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">x w</td>
<td class="org-left">sub3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">e)</td>
<td class="org-left">a b z</td>
<td class="org-left">sub2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">x w</td>
<td class="org-left">sub3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">y</td>
<td class="org-left">sub1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">f)</td>
<td class="org-left">a y z</td>
<td class="org-left">sub1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">b</td>
<td class="org-left">sub2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">x w</td>
<td class="org-left">sub3</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-10-31 Mon 00:00</p>
<p class="author">Author: Habib Ghaffari</p>
<p class="date">Created: 2022-11-08 Tue 10:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
