TUT materials/T6/T6.tex

\section{Questions:}
\label{sec:org1bbf1f2}

\begin{enumerate}
\item Consider the following JavaScript skeletal program:
\end{enumerate}

\begin{verbatim}
 // The main program
 var x;
 function sub1(){
     var x:
     function sub2(){
         . . .
     }
 } 
 function sub3(){
 . . .
}
\end{verbatim}

Assume that the execution of this program is in the following unit order:

\begin{itemize}
\item \texttt{main} calls \texttt{sub1}
\item \texttt{sub1} calls \texttt{sub2}
\item \texttt{sub2} calls \texttt{sub3}
\end{itemize}

Assuming static scoping, in the following, which declaration of \texttt{x} is the
correct one for a reference to \texttt{x}?

i. \texttt{sub1}, Why? (sub1)
ii. \texttt{sub2}, Why? (sub1)
iii. \texttt{sub3}, Why? (main)

Repeat part a, but assume dynamic scoping:


i. \texttt{sub1}, Why? (sub1)
ii. \texttt{sub2}, Why? (sub1) 
iii. \texttt{sub3}, Why? (sub1)

\begin{enumerate}
\item Let's write a peace of code in \texttt{JavaScript}:
\end{enumerate}

\begin{verbatim}
var x;
function sub1() {
 document.write("x = " + x + "");
}
function sub2() {
 var x;

 x = 10;
 sub1();
}
x = 5;
sub2();
\end{verbatim}

\begin{itemize}
\item What value of \texttt{x} is displayed if we use static-scope rules? Why?

x = 5

\item What if we use dynamic-scope rules? Why?

x = 10

\item Let's write another piece of code in \texttt{JavaScript}:
\end{itemize}

\begin{verbatim}
var x, y, z;
function sub1() {
var a, y, z;
  function sub2() {
   var a, b, z;
   . . .
  }
  . . .
}
function sub3() {
  var a, x, w;
  . . .
}
\end{verbatim}

List all the variables, along with the program units where they are declared,
that are visible in the bodies of \texttt{sub1}, \texttt{sub2}, and \texttt{sub3}, assuming
static scoping is used. Justify your answer:

\begin{itemize}
\item In sub1:
a     sub1
y     sub1
z     sub1
x     main
\item In sub2:
a sub2
b     sub2
z     sub2
y     sub1
x     main
\item In sub3:
a sub3
x sub3
w sub3
y main
z main

\item Consider the following \texttt{C} program:
\end{itemize}

\begin{verbatim}
void fun(void) {
int a, b, c; /* definition 1 */
. . .
while (. . .) {
int b, c, d; /*definition 2 */
. . . <------------- 1
while (. . .) {
int c, d, e; /* definition 3 */
. . . <------------- 2
}
. . . <-------------- 3
}
. . . <---------------- 4
}
\end{verbatim}

For each of the four marked points in this function, list each visible variable,
along with the number of the definition statement that defines it. Justify your
answer?


\begin{itemize}
\item Point 1:
a 1
b 2
c 2
d 2
\item Point 2:
a 1
b 2
c 3
d 3
e 3
\item Point 3:
a 1
b 2
c 2
d 2
\end{itemize}
Point 4:
  a 1
  b 1
  c 1


\begin{enumerate}
\item Consider the following skeletal \texttt{C} program:
\end{enumerate}

\begin{verbatim}
void fun1(void); /* prototype */
void fun2(void); /* prototype */
void fun3(void); /* prototype */
void main() {
int a, b, c;
. . .
}
void fun1(void) {
int b, c, d;
. . .
}
void fun2(void) {
int c, d, e;
. . .
}
void fun3(void) {
int d, e, f;
. . .
}
\end{verbatim}

Given the following calling sequences and assuming that dynamic scoping is used,
what variables are visible during execution of the last function called? Include
with each visible variable the name of the function in which it was defined.
Justify your answer?

a. \texttt{main} calls \texttt{fun1}; \texttt{fun1} calls \texttt{fun2}; \texttt{fun2} calls \texttt{fun3}.
b. \texttt{main} calls \texttt{fun1}; \texttt{fun1} calls \texttt{fun3}.
c. \texttt{main} calls \texttt{fun2}; \texttt{fun2} calls \texttt{fun3}; \texttt{fun3} calls \texttt{fun1}.
d. \texttt{main} calls \texttt{fun3}; \texttt{fun3} calls \texttt{fun1}.
e. \texttt{main} calls \texttt{fun1}; \texttt{fun1} calls \texttt{fun3}; \texttt{fun3} calls \texttt{fun2}.
f. \texttt{main} calls \texttt{fun3}; \texttt{fun3} calls \texttt{fun2}; \texttt{fun2} calls \texttt{fun1}.

\begin{center}
\begin{tabular}{lll}
\hline
Question & Variables & Where Declared\\
\hline
a) & d e f & fun3\\
 & c & fun2\\
 & b & fun1\\
 & a & main\\
\hline
b) & d e f & fun3\\
 & b c & fun1\\
 & a & main\\
\hline
c) & b c d & fun1\\
 & e f & fun3\\
 & a & main\\
\hline
d) & b c d & fun1\\
 & e f & fun3\\
 & a & main\\
\hline
e) & c d e & fun2\\
 & f & fun3\\
 & b & fun1\\
 & a & main\\
\hline
f) & b c d & fun1\\
 & e & fun2\\
 & f & fun3\\
 & a & main\\
\hline
\end{tabular}
\end{center}

\begin{enumerate}
\item Consider the following program, written in \texttt{JavaScript}-like
\end{enumerate}
syntax:

\begin{verbatim}
// main program
var x, y, z;
function sub1() {
var a, y, z;
. . .
}
function sub2() {
var a, b, z;
. . .
}
function sub3() {
var a, x, w;
. . .
}  
\end{verbatim}


Given the following calling sequences and assuming that dynamic scoping
is used, what variables are visible during execution of the last subprogram
activated? Include with each visible variable the name of the unit
where it is declared.


a. \texttt{main} calls \texttt{sub1}; \texttt{sub1} calls \texttt{sub2}; \texttt{sub2} calls \texttt{sub3}.
b. \texttt{main} calls \texttt{sub1}; \texttt{sub1} calls \texttt{sub3}.
c. \texttt{main} calls \texttt{sub2}; \texttt{sub2} calls \texttt{sub3}; \texttt{sub3} calls \texttt{sub1}.
d. \texttt{main} calls \texttt{sub3}; \texttt{sub3} calls \texttt{sub1}.
e. \texttt{main} calls \texttt{sub1}; \texttt{sub1} calls \texttt{sub3}; \texttt{sub3} calls \texttt{sub2}.
f. \texttt{main} calls \texttt{sub3}; \texttt{sub3} calls \texttt{sub2}; \texttt{sub2} calls \texttt{sub1}.

\begin{center}
\begin{tabular}{lll}
\hline
Question & Variables & Where Declared\\
\hline
a) & a x w & sub3\\
 & b z & sub2\\
 & y & sub1\\
\hline
b) & a x w & sub3\\
 & y z & sub1\\
\hline
c) & a y z & sub1\\
 & x w & sub3\\
 & b & sub2\\
\hline
d) & a y z & sub1\\
 & x w & sub3\\
\hline
e) & a b z & sub2\\
 & x w & sub3\\
 & y & sub1\\
\hline
f) & a y z & sub1\\
 & b & sub2\\
 & x w & sub3\\
\hline
\end{tabular}
\end{center}
\end{document}